import { click } from '@testing-library/user-event/dist/click'
import { useState } from 'react'

function App() {


  const [regionN, setRegionN] = useState(0)

  const regions  = [
   
    {
      name: "Երևան",
      description: "Երևանն աշխարհի հնագույն քաղաքներից է։ Հնագիտական պեղումներով պարզվել է, որ մարդն այստեղ բնակվել է տասնյակ հազարավոր տարիներ առաջ։ Քաղաքի տարածքում տարբեր ժամանակաշրջաններում առաջացել և զանազան պատճառներով կործանվել են բազմաթիվ բնակավայրեր։ Ժամանակագրական առումով՝ քաղաքի տարածքի հնագույն բնակավայրը Երևանյան կամ Հրազդան-1 քարայրն է (Երևանյան լճի մոտ՝ Հրազդան գետի ձախ ափին, ներկայումս ԱՄՆ դեսպանատան տարածքում), որի հնագույն՝ ստորին շերտը (4–5 մշակութային շերտ) թվագրվում է մուստերյան շրջանով (100–35 հազարամյակ առաջ)։ Ընդհանուր առմամբ Հրազդանի կիրճում քարայրների թիվը մոտ հարյուր է։ Որպես հին բնակավայր հայտնի է նաև Շենգավիթը. այստեղ մարդիկ բնակություն են հաստատել 5–6 հազար տարի առաջ[10]։ Հայ մատենագիրները՝ վկայակոչելով քաղաքային լեգենդը Երևանի անվան ծագումը երկար ժամանակ կապել են Նոյյան տապանի աստվածաշնչյան ավանդության հետ. իբրև երբ Նոյի տապանը կանգ է առել Արարատի գագաթին, Նոյը, ջրհեղեղից հետո տեսնելով առաջին ցամաքը, որն ապագա Երևանի կառուցման վայրն էր, գոչել է՝ երևա՜ց (այստեղից էլ՝ «Երևան» անվանումը)։Առավել տարածված է այն տեսակետը, որ «Երևան» անունը կապված է Էրեբունի բերդաքաղաքի անվան հետ։ Սակայն կան նաև այլ տեսակետներ. դրանցից մեկի համաձայն՝ հիմնադրված նոր բնակավայրի անվանակոչման համար Արգիշտի Ա-ն կամ օգտագործել է տարածքում եղած ու նրան հայտնի հնագույն այլ բնակավայրի անուն, կամ կոչել է «երի» կամ «արի» ցեղի (երկրի) անունով։ Հայկական լեռնաշխարհից ու շրջակա տարածքներից հեռացած հնդեվրոպացիների նախնիները՝ արիական ցեղերը, հիշում են իրենց՝ արի ցեղին պատկանելու փաստը և գրավոր աղբյուրներում նշում են այդ մասին (հնդկական վեդաներ, իրանական «Ավեստա», պարսից շահ Դարեհ Ա Աքեմենյանի Բեհիսթունի արձանագրություն)[փա՞ստ]։ Երևանը կոչվել է նաև Էրիվան, Էրևան, Ռևան, Իրավան, Այրիվան և այլ անուններով",
      img: <img  src='https://planetofhotels.com/guide/sites/default/files/styles/paragraph__live_banner__lb_image__1880bp/public/live_banner/Yerevan-1.jpg' />,
    },
    {

      name: "Արագածոտն",
      description: "Արագածոտնի մարզն զբաղեցնում է Արարատյան ֆիզիկա-աշխարհագրական շրջանի հյուսիսարևմտյան մասը (950 մետրից մինչև 4090 մ բացարձակ բարձրությունները)։ Հարավում լեռնալանջերը ձուլում են Արարատյան դաշտին, հյուսիսում ձգվում են մինչև Արագածի լեռնագագաթը։Արագածոտնը Հայաստանի այն մարզերից է, որտեղ հանդիպում են հայտնի բոլոր վերընթաց լանդշտաֆտային գոտիները։Մարզի մակերևույթի մեծ մասը կազմված է տարբեր տիպի ու բնույթի երիտասարդ հրաբխային լավաներից։ Այստեղ են գտնվում Թալինի, Կարմրաշենի, Ապարանի սարավանդները, որոնց մակերևույթին բնորոշ են խարամային կոները, տուֆային դաշտերը, քարակարկառները։ Այստեղ է գտնվում Փոքր Սիփան լեռը (հայտնի է նաև որպես Սիփան)։Բազմաթիվ են լավային ծածկույթների տակից բխող սառնորակ աղբյուրները, որոնցից սնվում են գետակները։ Մարզի հիմնական զարկերակը Քասաղ գետն է՝ Գեղարոտ և Ամբերդ գլխավոր վտակներով։ Քասաղի վրա կառուցվել է Ապարանի ջրամբարը       Հայտնի է Մաստարայի սելավային գետակը, որը հաճախ վարարելով մեծ վնաս է հասցնում ցանքատարածություններին։Արագածի մերձգագաթային սարավանդի վրա գտնվում է Քարի լիճը։Մակերևույթի բարձրությունների մեծ տատանումների շնորհիվ կլիման նույնպես բազմազան է։ Մեծ են ցածրադիր և բարձրադիր մասերի կլիմայական պայմանների տարբերությունները։ Եթե տարվա ամենատաք ամսվա՝ հուլիսի միջին ջերմաստիճանը լեռան ստորոտում լինում է 24-ից ոչ պակաս, ապա բարձրլեռնային գոտում չի բարձրանում 6-ից։ Արագածի մերձգագաթային հատվածում նույնիսկ ամռանը կարելի է հանդիպել ձնաբծերի։  Նույն օրինաչափությամբ էլ լանջերն ի վեր փոխվում է մթնոլորտային տեղումների քանակը՝ 400 մմ-ից մինչև 1000 մմ։",
      img: <img  src= 'https://www.hamshen.am/storage/tour-days/June2021/LKHiJHPgY1cNW5ud6SM6.jpg'  />
    },
    {
      name: "Արարատ",
      description: "Արարատի մարզը տնտեսապես Հայաստանի ամենազարգացած մարզերից է, հատկապես կարևոր է մարզի գյուղատնտեսական նշանակությունը։ Ունենալով Արարատյան դաշտի մի մեծ հատված՝ մարզը տալիս է Հայաստանի գյուղատնտեսական արտադրանքի զգալի մասը։ Առավել զարգացած է երկրագործությունը։ Հիմնական պտղատու այգիներն են խաղողի, ծիրանի, դեղձի այգիները, մշակվում են նաև կեռաս, սալոր, խնձոր, տանձ և այլն։ Մարզի հիմնական մշակաբույսերն են ձմերուկ, սեխ, լոլիկ, վարունգ, լոբի, սիսեռ, կանաչ պղպեղ, սմբուկ, ցորեն։ Երկրագործությունը 90 տոկոսով ոռոգովի է։ Այդ նպատակով օգտագործվում է ինչպես գետերի ջրերը՝ իրենց ջրանցքներով, այնպես էլ արտեզյան հորերի ջրերը։ Լեռնային հատվածներում զարգացած է նաև անասնապահությունը՝ հիմնականում ոչխարաբուծություն, ավելի քիչ՝ խոշոր եղջերավոր անասնապահություն։ Արարատի մարզի արդյունաբերությունում, կարևոր տեղ ունի լեռնահանքային արդյունաբերությունը։ Արարատ քաղաքի մոտ արդյունահանվում է տրավերտին, կրաքար, ավազ, մարզի այլ հատվածներում նույնպես կան տրավերտինի, ավազի, մարմարի, բազալտի հանքեր։ Կան հանքային ջրեր՝ Արարատ և Վեդի։ Մետաղական հանածոների արդյունաբերական պաշարներ չկան։ Շատ մեծ է սննդի արդյունաբերության նշանակությունը։ Գոյություն ունեն մի շարք գործարաններ, որոնք զբաղվում են մարզում արտադրված գյուղմթերքի վերամշակմամբ՝ մուրաբաների, բնական հյութերի, պահածոների, տոմատի մածուկների արտադրությամբՄարզը նաև ալկոհոլային խմիչքների արտադրության առանցքային կենտրոններից է։ Հիմնական արտադրատեսակներն են կոնյակ, գինի, օղի։ Զբոսաշրջային խոշոր կենտրոն է Խոր Վիրապի վանական համալիրը։",
      img: <img  src='https://armenia-tour.am/wp-content/uploads/st_uploadfont/ararat13.png' />
    },
    {
      name: "Արմավիր",
      description: "Արմավիրի մարզ, վարչատարածքային միավոր Հայաստանում։ Արմավիրի մարզկենտրոնն Արմավիր քաղաքն է։ Տարածքը 1242 կմ² է, բնակչությունը 284 հազար մարդ։ Գտնվում է 800-1000 մ բարձրություններում։ Մարգարա գյուղի մոտ Արաքս գետի վրա կառուցված ավտոճանապարհային կամուրջը Հայաստանը միացնում է Թուրքիային։ Մարզի տարածքը եղել է պատմական Հայաստանի Այրարատ նահանգի մի մասը։ Կլիման խիստ ցամաքային է։ Մթնոլորտային տեղումների քանակը չի գերազանցում 300 մմ։ Ամառը շոգ է, տևական (4-5 ամիս)։Հաճախ ջերմաստիճանը բարձրանում է մինչև 40-42 °C։ Բնորոշ են լեռնահովտային քամիները։ Ձմեռը ցուրտ է, անամպ, անհողմ։ Գարունը կարճատև է։ Առանձնապես հաճելի է արևոտ, անհողմ, տևական աշունը, երբ հասունանում են այգիների ու դաշտերի բարիքները։ Հարթավայրային մասի բնական կիսաանապատային լանդշաֆտները խիստ փոփոխված են։ Ներկայումս տիրապետում են մարդածին լանդշաֆտները։ Բնական ծածկույթը, որը հումուսով աղքատ գորշահողեր են, հազարամյակների ընթացքում ոռոգովի երկրագործրության պայմաններում վերածվել է կուլտուր-ոռոգելի հողերի։ Հարթության ցածրադիր մասերում գոյացել են ճահճուտներ։Մարզը հարուստ չէ օգտակար հանածոներով։ Բազմաթիվ են պատմական և ճարտարապետական հուշարձանները։ Հայտնաբերվել են Մեծամորի բրոնզեդարյան մետաղաձուլարանը, Վանի թագավորության քաղաք Արգիշտիխինիլիի ավերակները։",
      img:<img  src='https://upload.wikimedia.org/wikipedia/commons/f/ff/Armavir.jpg' />
    },
    {
      name: "Գեղարքունիք",
      description: "Տարածքի մեծությամբ այն առաջինն է Հայաստանում։ Մարզն այնքան մեծ է, որ նրանում հանգիստ կտեղավորվեն Արարատի, Արմավիրի և Կոտայքի մարզերն ամբողջությամբ։ Ամբողջ տարածքի շուրջ 1/4-ը զբաղեցնում է Սևանա լիճը։ Հյուսիսից սահմանակից է Տավուշի մարզին, արևելքից՝ Ադրբեջանին և Արցախին, արևմուտքից՝ Կոտայքի և Արարատի մարզերին, իսկ հարավից՝ Վայոց ձորի մարզին։ Տրանսպորտաաշխարհագրական դիրքը, ի տարբերություն Հայաստանի այլ մարզերի, անբարենպաստ է։ Գլխավոր ճանապարհներն են՝ Ճամբարակ-Բերդ, Մարտունի-Եղեգնաձոր և Երևան-Սևան-Սոթք երկաթուղին Տարածքում շատ են հրաբխային կոները, որոնցից հայտնի են հատկապես Արմաղանն ու Աժդահակը, որոնց խառնարաններում գտնվում են համանուն լճերը։ Գլխավոր լեռնաշղթաներն են Գեղամա, Արեգունի, Սևանի, Արևելյան Սևանի, Վարդենիսի։ Սևանի ավազանն արգավանդ հողերով հարուստ է, հատկապես կարևոր է Մասրիկի դաշտը՝ 1900-2200 մ բարձրություններում։ Կլիման բարեխառն լեռնային է. ձմեռները ցուրտ են, առաջանում է կայուն ձնածածկույթ։ Հունվարյան միջին ջերմաստիճանը -5˚-10˚ է։ Ամառները տաք են, արևոտ։ Միջին ջերմաստիճանն հասնում է +18˚+20˚։ Տեղումները քիչ են՝ 400-450 մմ, իսկ բարձրադիր շրջաններում մինչև 1000 մմ։ Օգտակար հանածոներից մեծ արժեք են ներկայացնում ոսկու (Սոթք), քրոմիտի (Շորժա), բնական շինանյութերի, հանքային ջրերի (Լիճք) և այլ պաշարները։Սևանա լիճը ամբողջությամբ գտնվում է Գեղարքունիքի մարզում։ Գեղարքունիքի մարզում է գտնվում Սոթքի ոսկու խոշոր հանքավայրերը։",
      img: <img  src='https://df.am/img/news/big/1476700734-788.jpeg' />
    },
    {
      name: "Կոտայք",
      description: "Կոտայքի մարզ, մարզի կարգավիճակ ունեցող վարչատարածքային միավոր Հայաստանում։ Միակ մարզն է, որը միջպետական սահման չունի Հայաստանի հարևան որևէ պետության հետ։ Կոտայքը միաժամանակ նաև այն չորս մարզերից մեկն է, որոնք անմիջապես հարում են մայրաքաղաք Երևանին[1]։Մարզի տարածքն ընդգրկում է Կոտայքի սարավանդը, Մարմարիկ գետի ավազանը, Հրազդան գետի ավազանի վերին ու միջին հատվածը, ինչպես նաև Գեղամա լեռնաշղթայի արևմտյան լանջերը[2]։ Այն հարավ-արևմուտքից սահմանակի է մայրաքաղաքին, արևմուտքից՝ Արագածոտնի, հյուսիսից՝ Լոռու, հյուսիս-արևելքից՝ Տավուշի, արևելքից՝ Գեղարքունիքի և հարավից՝ Արարատի մարզերին[2]։Կոտայքի մարզի վարչական կենտրոնը Հրազդանն է[3][4]։ Ամենամեծ քաղաքն Հրազդանն է։ Կոտայքի մարզը զբաղեցնում է 2089 կմ² տարածք (8-րդը Հայաստանի մարզերի շարքում)։ Ըստ 2011 թվականի տվյալների՝ մարզի բնակչությունը կազմում է 254 397 մարդ[5]։Կոտայքի արևմտյան մասը նախկինում մտել է Մեծ Հայքի Այրարատ նահանգի Կոտայք, իսկ արևելյանը՝ Մազազ գավառների մեջ[6]։ Ներկայիս վարչատարածքային միավորը ձևավորվել է Հայկական ԽՍՀ-ի մաս կազմող Աբովյանի, Հրազդանի և Նաիրիի շրջանների միավորման հետևանքով[7]։ Կոտայքի մարզը խորհրդային տարիներին ունեցել է զարգացած մեքենաշինական, հաստոցաշինական արդյունաբերություն, որն այժմ գրեթե վերացել է[8]։Կոտայքի մարզը Հանրապետության տնտեսական խոշորագույն կենտրոններից է։ Հրազդանում մինչ օրս գործում է ջերմաէլեկտրակայան[9] և ջրաէլեկտրակայան[10], որոնք բավարարում են Հայաստանի էներգետիկ պահանջների մի մասը[9]։  Մարմարիկ գետի ձախ ափին գտնվող Մեղրաձոր գյուղում պահվում են երկրի ոսկու պաշարների մեծ մասը։ Ծաղկաձոր քաղաքը Հայաստանի լեռնադահուկային սպորտի կենտրոնն է, որն ունի կարևոր զբոսաշրջային նշանակություն[11][12]։ Մարզի տարածքը հարուստ է նաև պատմամշակութային հուշարձաններով։ Դրանց մարգարիտը Գառնու հեթանոսական տաճարն է, որը կառուցվել է 1-ին դարում և համարվում է մինչ օրս պահպանված նախաքրիստոնեական հայկական արվեստի եզակի նմուշներից մեկը։ Նշանավոր են նաև Գրիգոր Մագիստրոս Պահլավունու կողմից կառուցված Բջնի բերդը, ինչպես նաև միջնադարյան Կեչառիսի վանքային համալիրը և Գեղարդավանքը՝ ուր և պահվում էր հայտնի գեղարդը, որով հռոմեացի զինվորը խոցել է Քրիստոսի կողը։",
      img: <img  src='https://armenia-tour.am/wp-content/uploads/st_uploadfont/1_92_big-%D0%BA%D0%BE%D0%BF%D0%B8%D1%8F.jpg' />
    
    },

    {
      name: "Լոռի",
      description: "Լոռու մարզ, մարզի կարգավիճակ ունեցող վարչատարածքային միավոր Հայաստանի հյուսիսում։ Զբաղեցնում է պատմական Հայաստանի Գուգարաց նահանգի արևելյան հատվածն ու Այրարատ նահանգի Նիգ գավառի հյուսիսային տիրույթները։Լոռու մարզն ունի ցայտուն արտահայտված բնական սահմաններ։ Այն ընդգրկում է Դեբեդ գետի ավազանն ամբողջությամբ և հիմնականում ունի լեռնային ռելիեֆ՝ բարձրադիր լեռներ, անդնդախոր, երբեմն սուր կտրվածքով կիրճեր։ Նրա տարածքում են ձգվում Ջավախքի, Բազումի, Փամբակի, Գուգարաց, Վիրահայոց և Հալաբի լեռնաշղթաները։ Առանձնանում են Լոռու,Փամբակի գոգավորությունները և Լոռվա ձորը։ Բնակավայրերը գտնվում են ծովի մակերևույթից 520-ից մինչև 1800 մետր բարձրության վրա։  Մարզի վարչական կենտրոն հանդիսացող Վանաձոր քաղաքը համարվում է Հայաստանի երրորդ խոշորագույն քաղաքը՝ շուրջ 80 հազար բնակչությամբ։ Մյուս խոշոր բնակավայրերն են Ալավերդին, Ստեփանավանը, Սպիտակը, Թումանյանը, Ախթալան և Տաշիրը։ Ըստ 2020 թվականի տարեսկզբի տվյալների՝ մարզի բնակչությունը կազմում է 213․3 հազար մարդ, որի ճնշող մեծամասնությունը հայերն են, սակայն համեմատականորեն քիչ չեն նաև ազգային փոքրամասնությունների (ռուսական, հունական, եզդիական, ուկրաինական և այլն) համայնքները։Լոռին Հայաստանի արդյունաբերական մարզերից է։ Այստեղ են գործում Հայաստանի տնտեսության արդյունաբերական ճյուղի անկյունաքարային նշանակություն ունեցող մի շարք օբյեկտներ։ Արդյունաբերության զարգացվածության ֆոնին ավելի քիչ զարգացած է գյուղատնտեսությունըԼոռին աչքի է ընկնում նաև հարուստ մշակութային ժառանգությամբ և պատմական անցյալով, որի մասին վկայում են տասնյակ վանքերը, բերդերը, ամրոցներն ու հուշակոթողները։ Պատմամշակութային ինքնատիպ հուշարձանների բազմազանությունը որոշակիորեն պայմանավորված է այն հանգամանքով, որ 10-12-րդ դարերում այստեղ գոյություն է ունեցել անկախ հայկական պետականություն՝ ի դեմս Լոռու կամ Տաշիր-Ձորագետի թագավորության։ Հայաստանում ՅՈՒՆԵՍԿՕ-ի Համաշխարհային ժառանգության ցանկում ներառված օբյեկտներից երկուսը՝ Հաղպատի ու Սանահինի միջնադարյան վանական համալիրները գտնվում են Լոռու մարզում։",
      img: <img src='https://samvelgevorgyan.com/wp-content/uploads/2019/09/BSC-Lori-Marz-1280x854.jpg' />
    },
    {
      name: "Շիրակ",
      description: "Մարզի տարածքում են գտնվում Արփի լիճ-ջրամբարը, Ախուրյանի ջրամբարի հայկական հատվածը և Մանթաշի ջրամբարը։ Շիրակի մարզի կենտրոնական և հարավային հատվածում տարածվում է Շիրակի դաշտը, իսկ հյուսիսային շրջանում՝ Աշոցքի սարահարթը, միաժամանակ Շիրակի մարզում են տարածվում Փամբակի, Բազումի լեռնաշղթաների, Եղնախաղի, Ջավախքի, Արագածի լեռնազանգվածների մի մասը։ Երկրաբանական կառուցվածքի տեսակետից տարածքը ընդհանուր առմամբ ունի համեմատաբար միատարր հրաբխային կազմություն և երիտասարդ հասակ։ Հայկական լեռնաշխարհի հետ միասին մարզի տարածքն անցել է երկրաբանական զարգացման բարդ ուղի։ Եռանդուն տեկտոնական շարժումները, որոնց շնորհիվ երկրակեղևը ծալքավորվել ու կոտրվել է, տեղի է ունեցել երկրաբանական տարբեր ժամանակաշրջաններում։ Սակայն մարզի ռելիեֆի ձևավորման գործում գլխավոր դերը պատկանում է ալպյան լեռնակազմությանը, երբ տարածքը բարձրացել է ծովի հատակից և թևակոխել ցամաքային զարգացման փուլ։ Հետագայում, շարունակվելով վերընթաց տեկտոնական շարժումները, ձևավորվել են միջին բարձրության լեռներ։ Նեոգենի ժամանակաշրջանի կեսերին տեղի ունեցած հզոր լեռնակազմական պրոցեսների հետևանքով տարածքի շրջակա լեռները դարձել են ավելի բարձր, հովիտները` ավելի խորը։ Այդ ժամանակաշրջանում է, որ այստեղ գոյանում են երկրակեղևի տարբեր ուղղություններով ձգվող Սևան-Շիրակի, Ջավախք-Արագած-Մասիսի և Աշոցքի բեկվածքները[2]։Եռանդուն տեկտոնական շարժումները ուղեկցվել են բուռն հրաբխականությամբ, որն ընդգրկել է մարզի ամբողջ տարածքը` սկսած Եղնախաղից, Աշոցքից մինչև Արագած։ Հրաբխային արտավիժման և ժայթքման նյութերը ծածկել են հսկայական տարածություններ` իրենց տակ թողնելով ծալքավոր և ծալքաբեկորավոր լեռների խղզման գծերի զգալի մասը` դրանց վրա գոյացնելով հրաբխային լեռնավահաններ, առանձին լեռնազանգվածներ, սարավանդներ։ Նման եղանակով են գոյացել Արագած լեռնազանգվածը, Ջավախքի, Աշոցքի, Եղնախաղի լեռնավահանները, Աշոցքի և Շիրակի սարահարթերը։",
      img: <img src='https://galatv.am/wp-content/uploads/2022/03/275359165_512634093544051_4999419628160225636_n.png' />
    },
    {
      name: "Սյունիք",
      description: "Սյունիքի մարզ, ամենաբարձր կարգավիճակ ունեցող վարչատարածքային միավոր Հայաստանի հարավում։ Հյուսիսում սահմանակից է Հայաստանի Վայոց ձորի մարզին, հյուսիս-արևելքում՝ Արցախի Հանրապետության[Ն 1] Շահումյանի շրջանի քարվաճառյան հատվածին և Քաշաթաղի շրջանին, հարավում՝ Իրանի Իսլամական Հանրապետությանը Արևելյան Ադրբեջան նահանգին, արևմուտքից՝ Ադրբեջանի Հանրապետության կազմում ընդգրկված Նախիջևանի Ինքնավար Հանրապետության Ջավախքի, Օրդուբադի և Շահբուզի շրջաններին[1]։Սյունիքն ունի հազարամյակների պատմություն․ այն սկսվում է անհիշելի ժամանակներից, շարունակվում Վանի թագավորության, Մեծ Հայքի թագավորության, Սյունիքի իշխանության շրջաններով։ Մարզը հարուստ է պատմամշակութային ժառանգություն։ Այստեղ պահպանվել են նախնադարյան բնակատեղիներ, ամրություններ, դամբարանադաշտեր, մեր թվարկությամբ թվագրվող ամրոցներ, կրոնական կառույցներ և ձեռակերտ այլ արժեքավոր օբյեկտներ[1]։Մարզի վարչական կենտրոն հանդիսացող Կապան քաղաքը համարվում է բնակչության թվաքանակով Հայաստանի վեցերորդ խոշորագույն քաղաքը՝ շուրջ 42․600 բնակչությամբ։ Մյուս խոշոր բնակավայրերն են Գորիսը, Սիսիանը, Քաջարանը, Մեղրին, Ագարակը։ 2020 թվականի հունվարի 1-ի դրությամբ՝ մարզի բնակչությունը կազմում է 135․800 մարդ[2]։      Սյունիքի տարածքն ունի հարուստ կենսաբազմազանություն։ Այն հիմնականում կազմված է լեռնային գոտիներից։ Սյունիքի մարզի տարածքը կազմում է 4506կմ2, ինչը Հայաստանի ընդհանուր տարածքի 15.1%-ն է[1]։ Վարչատարածքային բաժանման տեսակետից Սյունիքի մարզը բաժանված է 8 համայնքի, որոնցից յուրաքանչյուրն ընդգրկում է բազմաթիվ բնակավայրեր։ Մարզի համայնքներն են՝ Գորայքը (կենտրոնը՝ Գորայք գյուղ), Մեղրին (կենտրոնը՝ Մեղրի քաղաք), Տեղը (կենտրոնը՝ Տեղ գյուղ), Գորիսը (կենտրոնը՝ Գորիս քաղաք), Սիսիանը (կենտրոնը՝ Սիսիան քաղաք), Քաջարանը (կենտրոնը՝ Քաջարան քաղաք), Կապանը (կենտրոնը՝ Կապան քաղաք), Տաթևը (կենտրոնը՝ Շինուհայր գյուղ)։Սյունիքի մարզը ունի 138 բնակավայր․ 7 քաղաք՝ Ագարակ, Գորիս, Դաստակերտ, Կապան, Մեղրի, Սիսիան և Քաջարան, ու 131 գյուղ։",
      img: <img src='https://samvelgevorgyan.com/wp-content/uploads/News_2019/Syunik-Marz-BSC25/Goris-mountains.jpg' />
    }, {
      name: "Տավուշ",
      description: "Տավուշ մարզի ուղղաձիգ գոտիականությունը կանխորոշում է մարզի կլիման։ Այն գտնվում է հանրապետության չափավոր խոնավ տարածաշրջանում։ Արևափայլքի տարեկան տևողությունը 1900-2000 ժամ է։ հանրապետությունում առավելագույն անարև օրերի դիտվում է Իջևանում՝ մինչև 65օր։ Գարունը լինում է տևական և հաճախ ուղեկցվում ցրտահարություններով, ամառը չափավոր տաք է, ձմեռը՝ մեղմ։ Լեռների բարձրության և դիրքադրման հետ կապված՝ մարզի լեռնային հարավն ու հովտային հյուսիսը զգալիորեն տարբերվում են կլիմայական պայմաններով։ Հարավի բարձրադիր լեռներում նվազագույն ջերմաստիճանը կարող է հասնել -38°C-ի, իսկ առավելագույն ջերմաստիճանը հյուսիսի ցածրադիր հովիտներում՝ 38-40 °C-ի։ վերջին տասնամյակներում անսովոր շոգեր գրանցվել են 1996 և 2000 թվականին, երբ Նոյեմբերյանում, Բերդում և Իջևանում ջերմաչափը ցույց է տվել համապատասխանաբար 42-43°C աստիճան, ընդ որում անսովոր շոգը ուղեկցվել է երաշտով, որի հետևանքով հսկայական վնասներ կրեցին գյուղացիական տնտեսությունները։ Լինում են նաև հակառակ երևույթը, երբ չափազանց շատ տեղումներ են տեղի ունենում, օրինակ 2002 թվականի ամռանը։ Տարեկան տեղումների քանակը 550-600 մմ է, առավելագույնը՝ ապրիլ-մայիս ամիսներին, որի պատճառով ծառերը հաճախ ծաղկավիժում են։ Ձյունածածկույթի հզորությունը միջին գոտիներում սովորաբար լինում է 10-15սմ, իսկ անսառնամանիք օրերի քանակը՝ 100-240։ Ձմռանը մարզի հարավային սարերում, ձյան առատության և բքի պատճառով դժվարանում է մայրուղիների երթևեկությունը։ Մարզում, ընդհանրապես, և Աղստևի հովտում հաճախակի երևույթ է կարկտահարությունը։",
      img: <img src='https://www.advantour.com/img/armenia/tavush/haghartsin-monastery.jpg' />
    },
    {
      name: "Վայոց ձոր",
      description: "Վայոց ձորի մարզ, մարզի կարգավիճակ ունեցող վարչատարածքային միավոր Հայաստանի հարավարևելյան վերջույթում։ Զբաղեցնում է պատմական Հայաստանի Սյունյաց նահանգի նույնանուն գավառի հիմնական տարածքը։ Ներկայիս վարչատարածքային միավորը ձևավորվել է Հայկական ԽՍՀ-ի մաս կազմած Եղեգնաձորի և Վայքի (Ազիզբեկովի) շրջանների միավորման հետևանքով՝ 1995 թվականի բարեփոխումների արդյունքում։Վայոց ձորի մարզը զբաղեցնում է 2,308 կմ² տարածք (7-րդը Հայաստանի մարզերի շարքում)։ Ընդգրկում է երեք հիմնական աշխարհագրական շրջաններ՝ Արփայի գոգավորություն, Վայքի ծալքաբեկորավոր լեռնաշղթա (ձգվում է հարավում) և Վարդենիսի հրաբխային լեռնավահան։ Հյուսիսում սահմանակցում է Գեղարքունիքի մարզին, հյուսիս-արևելքում՝ Արցախի Հանրապետությանը, հարավ-արևմուտքում՝ Սյունիքի մարզին, հարավային հատվածում՝ Նախիջևանին, իսկ արևմուտքում՝ Արարատի մարզին։ Մայրաքաղաք Երևանին անմիջապես չի հարում։Վայոց ձորի մարզի վարչական կենտրոնը Եղեգնաձոր համայնքն է (բնակչությունը՝ 7800 մարդ), որը հանդիսանում է նաև մարզի խոշորագույն քաղաքը։ Վարչատարածքային միավորի մյուս քաղաքային բնակավայրերն են Վայքն ու Ջերմուկը։ Վերջինս համարվում է զբոսաշրջային կարևոր նշանակություն ունեցող առողջարանային քաղաք։ Ըստ 2019 թվականի մարդահամարի տվյալների՝ մարզի բնակչությունը կազմում է 49 հազար մարդ, որը ճնշող մեծամասնությունը հայերն են (99 % և ավելի)։ Վայոց ձորը համարվում է Հայաստանի ամենաքիչ և ամենանոսր բնակեցված մարզը։Վայոց ձորը Հայաստանի տնտեսապես ամենաթույլ զարգացած մարզերից մեկն է։ Տնտեսության առաջատար ճյուղը գյուղատնտեսությունը, որի ավանդական ուղղություններից մեկն էլ խաղողագործությունն է։ Ինքնին, Վայոց ձորը հանդիսանում է Հայաստանի խաղողագործական չորս շրջաններից մեկը, որը աչքի է ընկնում գինեգործության հազարամյա ավանդույթներով։ «Արենի» տեսակի խաղողից այստեղ պատրաստվում է նույնանուն հանրահայտ գինին։",
      img: <img src='https://www.advantour.com/img/armenia/vayots-dzor/vayots-dzor.jpg'/>
    },

  ]


  return (
    <div>
      <div style={{ display: "flex", }}>
        <div>
          {regions.map(
            (x, i) => <div

              key={i}
              onClick={() => setRegionN(i)}
              style={{ border: "1px solid black",  cursor: 'pointer' }}
            >
              {x.name}
            </div>
          )}


        </div>
        <div>


        </div>
        <div style={{ border: "1px solid black",padding: 5 }}>{regions[regionN].description}
          <div style={{ width: "100%", height: "100%", border:"1px solid white" }}>{regions[regionN].img}</div>

        </div>

      </div>

    </div>
  )

}
export default App