import React, { useState, useEffect } from 'react'
import { Link } from 'react-router-dom';
import styles from './Page.module.css'

import { useParams } from 'react-router-dom';

const Page = (...arg) => {

    const pages = [
        {
            name: "բոլորը",
        },
        {
            name: "երևան",
        },
        {
            name: "արագածոտն",
        },
        {
            name: "արարատ",
        },
        {
            name: "արմավիր",
        },
        {
            name: "գեղարքունիք",
        },
        {
            name: "կոտայք",
        },
        {
            name: "լոռի",
        },
        {
            name: "շիրակ",
        },
        {
            name: "սյունիք",
        },
        {
            name: "տավուշ",
        },
        {
            name: "վայոց ձոր",
        },
    ]

    const [info, setInfo] = useState({
        name: "երևան",
        description: "<b>Երևանն աշխարհի հնագույն քաղաքներից է</b>։ Հնագիտական պեղումներով պարզվել է, որ մարդն այստեղ բնակվել էԱռավել տարածված է այն տեսակետը, որ <b>«Երևան» անունը կապված է Էրեբունի բերդաքաղաքի անվան հետ</b>։ Սակայն կան նաև այլ տեսակետներ. դրանցից մեկի համաձայն՝ հիմնադրված նոր բնակավայրի անվանակոչման համար Արգիշտի Ա-ն կամ օգտագործել է տարածքում եղած ու նրան հայտնի հնագույն այլ բնակավայրի անուն, կամ կոչել է «երի» կամ «արի» ցեղի (երկրի) անունով։ Հայկական լեռնաշխարհից ու շրջակա տարածքներից հեռացած հնդեվրոպացիների նախնիները՝ արիական ցեղերը, հիշում են իրենց՝ արի ցեղին պատկանելու փաստը և գրավոր աղբյուրներում նշում են այդ մասին (հնդկական վեդաներ, իրանական «Ավեստա», պարսից շահ Դարեհ Ա Աքեմենյանի Բեհիսթունի արձանագրություն)[փա՞ստ]։ Երևանը կոչվել է նաև Էրիվան, Էրևան, Ռևան, Իրավան, Այրիվան և այլ անուններով։ 3-րդ դարի սոգդիական-մանիքեական մի տեքստում նշվում է, որ քրիստոնեական համայնքի կողքին Մանիի (պարսիկ նկարիչ, մանիքեության հիմնադիրը) աշակերտներից մեկը Ռավան բնակավայրում հիմնել է մանիքեական համայնք։ Սա հիմք է տալիս ենթադրելու, որ խոսքը կարող է Երևանի մասին լինել։ <b>1918 թվականի մայիսի 28-ին՝ մայիսյան հերոսամարտների՝ Սարդարապատի, Բաշ-Ապարանի և Ղարաքիլիսայի արդյունքում[ ծնվեց Հայաստանի Առաջին Հանրապետությունը</b>։ Ավելի քան 400 տարի վարչաքաղաքական կենտրոնի պատմություն ունեցող Երևանը դառնում է նորանկախ հանրապետության մայրաքաղաքը։ <b>1918 թվականի հոկտեմբերի 30-ին Մուդրոսում կնքվեց զինադադար Անտանտի և Օսմանյան կայսրության միջև, որով վերջինս ճանաչեց իր պարտությունը և դուրս եկավ Առաջին համաշխարհային պատերազմից</b>։ Դրանով վերականգնվեցին ՀՀ սահմանները՝ ներառելով Երևանի նահանգը ամբողջությամբ, Կարսի մարզի մեծ մասը, Ելիզավետպոլի նահանգի լեռնային շրջանները՝ Սյունիքը, Արցախը և Տավուշը, Թիֆլիսի նահանգի հայկական տարածքները՝ Ախալքալաքը և Լոռին։ Վանի թագավորության անկումից հետո Երևանի շուրջ 1000-ամյա պատմության մասին հայ մատենագրական աղբյուրները լռում են։ Երևանը կրկին հիշատակվում է 7-րդ դարում՝ «Գիրք թղթոցի» մեջ։ Պատմիչ Սեբեոսը վկայում է, որ արաբական արշավանքների ժամանակ Երևանը վաճառաշահ ու այգեշատ քաղաք էր։Վանի թագավորության քաղաք Էրեբունին հիմնադրվել է <b>Ք.ա. 782 թվականին</b>։Ըստ Վանում գտնված սեպագիր տարեգրության՝ Վանի թագավորության արքա Արգիշտի Ա-ն իր ղեկավարման 5-րդ տարում կառուցեց Էրեբունի քաղաքը[փա՞ստ]։<b>19-րդ դարի վերջերին հնագետ Ալեքսեյ Իվանովսկին Նորքի բնակիչ Պ. Տեր-Ավետիքյանից ձեռք է բերել նրա բակում հայտնաբերված մի բազալտե սեպագիր արձանագրություն, որն էլ վերծանվում և հրատարակվում է Միխայիլ Նիկոլսկու կողմից</b>։ Դրանում նշվում էր Արգիշտիի կողմից Էրեբունի ամրոցի հիմնադրման մասին, սակայն ամրոցի ստույգ վայրը մնում է գաղտնի։1950 թվականին մեկնարկած հնագիտական աշխատանքների ընթացքում Արին-Բերդ բլրի վրա գտնվել է Էրեբունու հիմնադրման առիթով կանգնեցված արձանագրությունը, ինչը վերջապես ապացուցում է Էրեբունի գտնվելու ստույգ վայրը։ Սալաքարի վրա գրված էր. Երևան են տեղափոխվում վարչաքաղաքական մարմինները, բացվում են հյուպատոսարաններ։ Երևան բնակություն են հաստատում հարյուրավոր հայեր՝ ոչ միայն Արևելյան, այլև Արևմտյան Հայաստանից[52]։ Նրանց մի մասը գաղթականներ էին[52]։ 1919 թվականին բացվում է Երևանի պետական համալսարանը։ Բազմաթիվ սփյուռքահայեր իրենց պատրաստակամությունն են հայտնում ներդրումներ կատարել նորանկախ Հայաստանում, իսկ ոմանք կտակում են իրենց ունեցվածքը։ <b>1920 թվականին Մոսկվայում սկսվել էին հայ-ռուսական բանակցությունները</b>։ Հոկտեմբերի կեսին, թուրք-հայկական պատերազմի ժամանակ, Երևանում սկսվեց բանակցությունների երկրորդ փուլը։ Հոկտեմբերի 28-ին ստորագրվեց հայ-ռուսական նախնական հաշտության պայմանագիրը, որի նախագծով Ռուսաստանը պետք է ստիպեր թուրքերին զորքը հետ քաշել մինչև 1914 թվականի սահմանը, ինչպես նաև ճանաչել ՀՀ իրավունքները Նախիջևանի և Զանգեգուրի նկատմամբ։ Հայաստանը պարտավորվում էր հրաժարվել Սևրի պայմանագրից և տարանցիկ ճանապարհի իրավունք տալ խորհրդային Կարմիր բանակին՝ զորք, զենք և ռազմամթերք փոխադրելու Թուրքիա[52]։ Սակայն հոկտեմբերի 31-ին հայկական զորքը առանց դիմադրության թուրքերին հանձնեց Կարսը։Ադրբեջանում ստեղծված Հայաստանի ռազմահեղափոխական կոմիտեն (ՌՀԿ) Սարգիս Կասյանի նախագահությամբ և Կարմիր բանակի ուղեկցությամբ <b>1920 թվականի նոյեմբերի 29-ին Ղազախից մուտք գործեց Հայաստան՝ Քարվանսարա (Իջևան) ու հայտարարեց Հայաստանի խորհրդայնացման մասին</b>։ Հայկական զորքը դիմադրություն ցույց չտվեց ռուսական զորամասերին։ Դեկտեմբերի 2-ին Երևանում ստորագրվեց համաձայնագիր, որով Հայաստանը խորհրդայնացվեց։ Նույն օրը սակայն, Ալեքսանդրապոլի պայմանագրով Ալ. Խատիսյանի գլխավորությամբ հայկական կողմը պաշտոնապես հրաժարվեց Սևրի պայմանագրից և Թուրքիային զիջեց Կարսի մարզը և Շիրակը։",
        img: [
            {
                src: 'https://app.conciergetravel.am/storage/OqYjxr7BQRXby8Gka3DHfs4gBu1olU8afrVuWbGu.jpg',
                text: "ՀԱՂԹԱՆԱԿ ԶԲՈՍԱՅԳԻ"
            },
            {
                src: 'https://app.conciergetravel.am/storage/oRST8CUXWxsv3oqbB0t8isRsyoZSQAxGq0JVk0N1.jpg',
                text: "ԾԻԾԵՌՆԱԿԱԲԵՐԴ"
            },
            {
                src: 'https://app.conciergetravel.am/storage/hAqoasgVpUo4tSv8ydJTGUarJWvPGfZCzOpQ8AQR.jpg',
                text: "Հայաստանի պատմության թանգարան"
            },
        ],

    })


    const [text, setText] = useState({})

    const { region } = useParams();

    const regions = [

        {
            name: "երևան",
            background: "https://upload.wikimedia.org/wikipedia/commons/8/87/Mount_Ararat_and_the_Yerevan_skyline_in_spring_from_the_Cascade.jpg",
            description: "<b>Երևանն աշխարհի հնագույն քաղաքներից է</b>։ Հնագիտական պեղումներով պարզվել է, որ մարդն այստեղ բնակվել էԱռավել տարածված է այն տեսակետը, որ <b>«Երևան» անունը կապված է Էրեբունի բերդաքաղաքի անվան հետ</b>։ Սակայն կան նաև այլ տեսակետներ. դրանցից մեկի համաձայն՝ հիմնադրված նոր բնակավայրի անվանակոչման համար Արգիշտի Ա-ն կամ օգտագործել է տարածքում եղած ու նրան հայտնի հնագույն այլ բնակավայրի անուն, կամ կոչել է «երի» կամ «արի» ցեղի (երկրի) անունով։ Հայկական լեռնաշխարհից ու շրջակա տարածքներից հեռացած հնդեվրոպացիների նախնիները՝ արիական ցեղերը, հիշում են իրենց՝ արի ցեղին պատկանելու փաստը և գրավոր աղբյուրներում նշում են այդ մասին (հնդկական վեդաներ, իրանական «Ավեստա», պարսից շահ Դարեհ Ա Աքեմենյանի Բեհիսթունի արձանագրություն)[փա՞ստ]։ Երևանը կոչվել է նաև Էրիվան, Էրևան, Ռևան, Իրավան, Այրիվան և այլ անուններով։ 3-րդ դարի սոգդիական-մանիքեական մի տեքստում նշվում է, որ քրիստոնեական համայնքի կողքին Մանիի (պարսիկ նկարիչ, մանիքեության հիմնադիրը) աշակերտներից մեկը Ռավան բնակավայրում հիմնել է մանիքեական համայնք։ Սա հիմք է տալիս ենթադրելու, որ խոսքը կարող է Երևանի մասին լինել։ <b>1918 թվականի մայիսի 28-ին՝ մայիսյան հերոսամարտների՝ Սարդարապատի, Բաշ-Ապարանի և Ղարաքիլիսայի արդյունքում[ ծնվեց Հայաստանի Առաջին Հանրապետությունը</b>։ Ավելի քան 400 տարի վարչաքաղաքական կենտրոնի պատմություն ունեցող Երևանը դառնում է նորանկախ հանրապետության մայրաքաղաքը։ <b>1918 թվականի հոկտեմբերի 30-ին Մուդրոսում կնքվեց զինադադար Անտանտի և Օսմանյան կայսրության միջև, որով վերջինս ճանաչեց իր պարտությունը և դուրս եկավ Առաջին համաշխարհային պատերազմից</b>։ Դրանով վերականգնվեցին ՀՀ սահմանները՝ ներառելով Երևանի նահանգը ամբողջությամբ, Կարսի մարզի մեծ մասը, Ելիզավետպոլի նահանգի լեռնային շրջանները՝ Սյունիքը, Արցախը և Տավուշը, Թիֆլիսի նահանգի հայկական տարածքները՝ Ախալքալաքը և Լոռին։ Վանի թագավորության անկումից հետո Երևանի շուրջ 1000-ամյա պատմության մասին հայ մատենագրական աղբյուրները լռում են։ Երևանը կրկին հիշատակվում է 7-րդ դարում՝ «Գիրք թղթոցի» մեջ։ Պատմիչ Սեբեոսը վկայում է, որ արաբական արշավանքների ժամանակ Երևանը վաճառաշահ ու այգեշատ քաղաք էր։Վանի թագավորության քաղաք Էրեբունին հիմնադրվել է <b>Ք.ա. 782 թվականին</b>։Ըստ Վանում գտնված սեպագիր տարեգրության՝ Վանի թագավորության արքա Արգիշտի Ա-ն իր ղեկավարման 5-րդ տարում կառուցեց Էրեբունի քաղաքը[փա՞ստ]։<b>19-րդ դարի վերջերին հնագետ Ալեքսեյ Իվանովսկին Նորքի բնակիչ Պ. Տեր-Ավետիքյանից ձեռք է բերել նրա բակում հայտնաբերված մի բազալտե սեպագիր արձանագրություն, որն էլ վերծանվում և հրատարակվում է Միխայիլ Նիկոլսկու կողմից</b>։ Դրանում նշվում էր Արգիշտիի կողմից Էրեբունի ամրոցի հիմնադրման մասին, սակայն ամրոցի ստույգ վայրը մնում է գաղտնի։1950 թվականին մեկնարկած հնագիտական աշխատանքների ընթացքում Արին-Բերդ բլրի վրա գտնվել է Էրեբունու հիմնադրման առիթով կանգնեցված արձանագրությունը, ինչը վերջապես ապացուցում է Էրեբունի գտնվելու ստույգ վայրը։ Սալաքարի վրա գրված էր. Երևան են տեղափոխվում վարչաքաղաքական մարմինները, բացվում են հյուպատոսարաններ։ Երևան բնակություն են հաստատում հարյուրավոր հայեր՝ ոչ միայն Արևելյան, այլև Արևմտյան Հայաստանից[52]։ Նրանց մի մասը գաղթականներ էին[52]։ 1919 թվականին բացվում է Երևանի պետական համալսարանը։ Բազմաթիվ սփյուռքահայեր իրենց պատրաստակամությունն են հայտնում ներդրումներ կատարել նորանկախ Հայաստանում, իսկ ոմանք կտակում են իրենց ունեցվածքը։ <b>1920 թվականին Մոսկվայում սկսվել էին հայ-ռուսական բանակցությունները</b>։ Հոկտեմբերի կեսին, թուրք-հայկական պատերազմի ժամանակ, Երևանում սկսվեց բանակցությունների երկրորդ փուլը։ Հոկտեմբերի 28-ին ստորագրվեց հայ-ռուսական նախնական հաշտության պայմանագիրը, որի նախագծով Ռուսաստանը պետք է ստիպեր թուրքերին զորքը հետ քաշել մինչև 1914 թվականի սահմանը, ինչպես նաև ճանաչել ՀՀ իրավունքները Նախիջևանի և Զանգեգուրի նկատմամբ։ Հայաստանը պարտավորվում էր հրաժարվել Սևրի պայմանագրից և տարանցիկ ճանապարհի իրավունք տալ խորհրդային Կարմիր բանակին՝ զորք, զենք և ռազմամթերք փոխադրելու Թուրքիա[52]։ Սակայն հոկտեմբերի 31-ին հայկական զորքը առանց դիմադրության թուրքերին հանձնեց Կարսը։Ադրբեջանում ստեղծված Հայաստանի ռազմահեղափոխական կոմիտեն (ՌՀԿ) Սարգիս Կասյանի նախագահությամբ և Կարմիր բանակի ուղեկցությամբ <b>1920 թվականի նոյեմբերի 29-ին Ղազախից մուտք գործեց Հայաստան՝ Քարվանսարա (Իջևան) ու հայտարարեց Հայաստանի խորհրդայնացման մասին</b>։ Հայկական զորքը դիմադրություն ցույց չտվեց ռուսական զորամասերին։ Դեկտեմբերի 2-ին Երևանում ստորագրվեց համաձայնագիր, որով Հայաստանը խորհրդայնացվեց։ Նույն օրը սակայն, Ալեքսանդրապոլի պայմանագրով Ալ. Խատիսյանի գլխավորությամբ հայկական կողմը պաշտոնապես հրաժարվեց Սևրի պայմանագրից և Թուրքիային զիջեց Կարսի մարզը և Շիրակը։",
            img: [
                {
                    src: 'https://app.conciergetravel.am/storage/OqYjxr7BQRXby8Gka3DHfs4gBu1olU8afrVuWbGu.jpg',
                    text: "ՀԱՂԹԱՆԱԿ ԶԲՈՍԱՅԳԻ"
                },
                {
                    src: 'https://app.conciergetravel.am/storage/oRST8CUXWxsv3oqbB0t8isRsyoZSQAxGq0JVk0N1.jpg',
                    text: "ԾԻԾԵՌՆԱԿԱԲԵՐԴ"
                },
                {
                    src: 'https://app.conciergetravel.am/storage/hAqoasgVpUo4tSv8ydJTGUarJWvPGfZCzOpQ8AQR.jpg',
                    text: "Հայաստանի պատմության թանգարան"
                },
            ],

        },
        {
            name: "արագածոտն",
            background: "https://img.freepik.com/premium-photo/beautiful-medieval-fortress-amberd-armenia_233809-57.jpg?w=2000",
            description: "<b>Արագածոտնի մարզն զբաղեցնում է Արարատյան ֆիզիկա-աշխարհագրական շրջանի հյուսիսարևմտյան մասը (950 մետրից մինչև 4090 մ բացարձակ բարձրությունները)</b>։ Հարավում լեռնալանջերը ձուլում են Արարատյան դաշտին, հյուսիսում ձգվում են մինչև Արագածի լեռնագագաթը։Արագածոտնը Հայաստանի այն մարզերից է, որտեղ հանդիպում են հայտնի բոլոր վերընթաց լանդշտաֆտային գոտիները։Մարզի մակերևույթի մեծ մասը կազմված է տարբեր տիպի ու բնույթի երիտասարդ հրաբխային լավաներից։ Այստեղ են գտնվում Թալինի, Կարմրաշենի, Ապարանի սարավանդները, որոնց մակերևույթին բնորոշ են խարամային կոները, տուֆային դաշտերը, քարակարկառները։ Այստեղ է գտնվում Փոքր Սիփան լեռը (հայտնի է նաև որպես Սիփան)։Բազմաթիվ են լավային ծածկույթների տակից բխող սառնորակ աղբյուրները, որոնցից սնվում են գետակները։ Մարզի հիմնական զարկերակը Քասաղ գետն է՝ Գեղարոտ և Ամբերդ գլխավոր վտակներով։ Քասաղի վրա կառուցվել է Ապարանի ջրամբարը       Հայտնի է Մաստարայի սելավային գետակը, որը հաճախ վարարելով մեծ վնաս է հասցնում ցանքատարածություններին։Արագածի մերձգագաթային սարավանդի վրա գտնվում է Քարի լիճը։Մակերևույթի բարձրությունների մեծ տատանումների շնորհիվ կլիման նույնպես բազմազան է։ Մեծ են ցածրադիր և բարձրադիր մասերի կլիմայական պայմանների տարբերությունները։ Եթե տարվա ամենատաք ամսվա՝ հուլիսի միջին ջերմաստիճանը լեռան ստորոտում լինում է <b>24-ից ոչ պակաս, ապա բարձրլեռնային գոտում չի բարձրանում 6-ից</b>։ Արագածի մերձգագաթային հատվածում նույնիսկ ամռանը կարելի է հանդիպել ձնաբծերի։  Նույն օրինաչափությամբ էլ լանջերն ի վեր փոխվում է մթնոլորտային տեղումների քանակը՝<b> 400 մմ-ից մինչև 1000 մմ</b>։ Որոշ վայրերում հանդիպում են կաղնու ոչ ընդարձակ անտառակներ։ Օգտակար հանածոները բազմազան չեն, բայց պաշարները մեծ են։ Դրանք հիմնականում հրաբխային ապարատեսակներին են՝ բազմագույն տուֆերը, բազալտը, պեռիլտը, հրաբխային խարամը, որոնք իրենց գոյությամբ պարտական են Արագած լեռան հրաբխային ժայթքումներին և ծառայում են որպես որակյալ շինանյութ։Բարձր լեռնային մասերում, լեռնամարգագետնային հողերի վրա տարածվում են մերձալպյան և ալպյան մարգագետիններ, որոնք հաճախ ընդմիջվում են քարակարկառներով ու լերկ ժայռերով։Մարզում շատ են ոչ միայն բնական, այլև պատմական ու ճարտարապետական հուշարձանները։ <b>Մարզկենտրոնի հարևանությամբ գտնվող Օշական գյուղում է գտնվում հայ գրերի ստեղծող սուրբ Մեսրոպ Մաշտոցի շիրիմ-դամբարանը</b>։",
            img: [

                {
                    src: 'https://app.conciergetravel.am/storage/Z0IDo75LMTYRiAhUfkDnffJ4qlmZJbNf8OsQgIfJ.jpg',
                    text: "ԱՐԱԳԱԾ ԼԵՌ"

                },
                {
                    src: 'https://app.conciergetravel.am/storage/whKatZzeE3lvQMyhXlc9ET63kR8KRG2Yw0wnJJqd.jpg',
                    text: "ԲՅՈՒՐԱԿԱՆԻ ԱՍՏՂԱԴԻՏԱՐԱՆ "
                },
                {
                    src: 'https://app.conciergetravel.am/storage/9zbLi326InawlOhZBu1I6PlYhTDP2QOAFJyY4yDD.jpg',
                    text: "ՔԱՐԻ ԼԻՃ"

                }
            ]
        },
        {
            name: "արարատ",
            background: "https://wallpapercave.com/wp/wp10387938.jpg",
            description: "<b>Արարատի մարզում տարեկան միջին ջերմաստիճանը ցածրադիր և բարձր լեռնային շրջանների միջև տատանվում է +10 °C-ի և -2 °C-ի միջև</b>։ Ձմռանն անհողմ եղանակի պայմաններում տեղի է ունենում ջերմաստիճանային շրջադասություն. սառն ու ծանր օդը կուտակվում է Արարատյան դաշտում։ Այդ պատճառով միջին գոտում՝ մինչև <b>2000 մետր բարձրությունները</b>, ձմեռը լինում է ավելի տաք և արևոտ, քան Արարատյան գոգավորությունում։ Գարունն անցողիկ է և կարճատև։ Մայիսի երկրորդ տասնօրյակից օդի ջերմաստիճանն անցնում է <b>15 °C-ից</b>, սկսվում է չոր, հաճախ խորշակներով երկարատև ամառը, որը շարունակվում է մինչև սեպտեմբերի երկրորդ կեսը։ Աշունը մեղմ է, անհողմ, հաճախ են թույլ անձրևները։ Մարզի հարթավայրային շրջանների համար բնորոշ են լեռնահովտային քամիները։ Ամռանը՝ կեսօրից հետո, քամին Գեղամա լեռներից փչում է հովիտներ՝ մեղմացնելով ամառվա տապը։ Հունվարյան միջին ջերմաստիճանն է այդ շրջաններում համապատասխանաբար <b>-6 °C և -12 °C, հուլիսյան ջերմաստիճանը՝ +26 °C և +8 °C, միջին տարեկան տեղումները՝ 200 մմ և 1000 մմ</b>։ Ցածրադիր շրջաններում դիտված բացարձակ առավելագույն և նվազագույն ջերմաստիճաններն են <b>-33 °C և +42 °C</b>, ընդ որում վերջինս Հայկական լեռնաշխարհում դիտարկված բացարձակ առավելագույն ջերմաստիճանն է և այն գրանցվել է Արարատյան հարթավայրի հարավ-արևելքում։ Ընդհանուր առմամբ Արարատի մարզն աչքի է ընկնում կլիմայի չորությամբ։ Տարածքի ամենացածր կետը հարավում է՝ Արաքսի հունի մոտ՝ <b>801 մ</b>։ Ամենաբարձր կետը հյուսիս-արևելքում գտնվող Սպիտակասար լեռնագագաթն է՝ <b>3555,7 մ։Տարածքի միայն մոտ 30%-ն է հարթավայրային</b>։Մարզի խոշոր գետերն են Արաքսը, Հրազդանը, Ազատը, Վեդին։ Համեմատաբար փոքր գետերից են Արածոն, Չորասու հեղեղատարը, Ազատի ու Վեդիի վտակները՝ Քաջառուն (Դարբանդ), Խոսրովը, և այլն։ Արարատյան հարթավայրով անցնող գետերը ունեն ոռոգիչ նշանակություն։ Արարատի մարզում տարածված են Հայաստանում առկա բոլոր 8 լանդշաֆտային գոտիները։ Ցածրադիր շրջաններից մինչև բարձրադիր շրջաններ դրանք հաջորդում են իրար այս հերթականությամբ. անապատային, կիսաանապատային, չոր տափաստանային, տափաստանային, լեռնաանտառային, մերձալպյան, ալպյան, ձյունամերձ։ Բայց սրանցից հիմնականներն են կիսաանապատային (Արարատյան հարթավայրում), չոր տափաստանային (միջին բարձրության լեռներում), ալպյան (Գեղամա լեռնաշղթայի լանջերին)։",
            img: [
                {
                    src: 'https://app.conciergetravel.am/storage/nBSmT8WOqI10QKLCZDNd6R7XG4rfRgcJwatw5qB4.jpg',
                    text: "ՀԻՆ ԱՐՏԱՇԱՏ"
                },
                {
                    src: 'https://app.conciergetravel.am/storage/H0KsHVK1CMEYozWrXN3yz5Z8hufqCoeBGJ0m8dbg.jpg',
                    text: "ԽՈՐ ՎԻՐԱՊ"
                },
                {
                    src: 'https://app.conciergetravel.am/storage/e7ci4WvaBKf1o6vQ74QHj2oicU4ZgVcfwSCAib4j.jpg',
                    text: "ԽՈՍՐՈՎԻ ԱՆՏԱՌ ԱՐԳԵԼՈՑ"
                }
            ]

        },
        {
            name: "արմավիր",
            background: "https://upload.wikimedia.org/wikipedia/commons/9/99/Etchmiadzin_cathedral.jpg",
            description: "<b>Արմավիրի մարզ, վարչատարածքային միավոր Հայաստանում։ Արմավիրի մարզկենտրոնն Արմավիր քաղաքն է։ Տարածքը 1242 կմ² է, բնակչությունը 284 հազար մարդ: Գտնվում է 800-1000 մ բարձրություններում</b>։ Մարգարա գյուղի մոտ Արաքս գետի վրա կառուցված ավտոճանապարհային կամուրջը Հայաստանը միացնում է Թուրքիային։ Մարզի տարածքը եղել է պատմական Հայաստանի Այրարատ նահանգի մի մասը։ Կլիման խիստ ցամաքային է։ Մթնոլորտային տեղումների քանակը չի գերազանցում <b>300 մմ։ Ամառը շոգ է, տևական (4-5 ամիս)</b>։Հաճախ ջերմաստիճանը բարձրանում է մինչև <b>40-42 °C</b>։ Բնորոշ են լեռնահովտային քամիները։ Ձմեռը ցուրտ է, անամպ, անհողմ։ Գարունը կարճատև է։ Առանձնապես հաճելի է արևոտ, անհողմ, տևական աշունը, երբ հասունանում են այգիների ու դաշտերի բարիքները։ Հարթավայրային մասի բնական կիսաանապատային լանդշաֆտները խիստ փոփոխված են։ Ներկայումս տիրապետում են մարդածին լանդշաֆտները։ Բնական ծածկույթը, որը հումուսով աղքատ գորշահողեր են, հազարամյակների ընթացքում ոռոգովի երկրագործրության պայմաններում վերածվել է կուլտուր-ոռոգելի հողերի։ Հարթության ցածրադիր մասերում գոյացել են ճահճուտներ։Մարզը հարուստ չէ օգտակար հանածոներով։ Բազմաթիվ են պատմական և ճարտարապետական հուշարձանները։ Հայտնաբերվել են Մեծամորի բրոնզեդարյան մետաղաձուլարանը, Վանի թագավորության քաղաք Արգիշտիխինիլիի ավերակները։ Հաճախ ջերմաստիճանը բարձրանում է մինչև 40-42 °C։ Բնորոշ են լեռնահովտային քամիները։ Ձմեռը ցուրտ է, անամպ, անհողմ։ Գարունը կարճատև է։ Առանձնապես հաճելի է արևոտ, անհողմ, տևական աշունը, երբ հասունանում են այգիների ու դաշտերի բարիքները։ Հարթավայրային մասի բնական կիսաանապատային լանդշաֆտները խիստ փոփոխված են։ Ներկայումս տիրապետում են մարդածին լանդշաֆտները։ Բնական ծածկույթը, որը հումուսով աղքատ գորշահողեր են, հազարամյակների ընթացքում ոռոգովի երկրագործրության պայմաններում վերածվել է կուլտուր-ոռոգելի հողերի։ Հարթության ցածրադիր մասերում գոյացել են ճահճուտներ։Մարզը հարուստ չէ օգտակար հանածոներով։ Բազմաթիվ են պատմական և ճարտարապետական հուշարձանները։ Հայտնաբերվել են Մեծամորի բրոնզեդարյան մետաղաձուլարանը, Վանի թագավորության քաղաք Արգիշտիխինիլիի ավերակները։Պատմաճարտարապետական մեծագույն արժեք են ներկայացնում<b> Էջմիածնի վանական կառույցները, Զվարթնոց տաճարի ավերակները, Վաղարշապատում Սուրբ Հռիփսիմե, Սուրբ Գայանե, Շողակաթ եկեղեցիները, ինչպես նաև Սարդարապատի հուշահամալիրը</b>։ Արմավիրի մարզը բնակչության թվով և խտությամբ Հայաստանում գրավում է առաջին տեղը։ Մարզին բնորոշ է այն, որ չնայած ռելիեֆային պայմանների միատարրությանը՝ բնակչության տեղաբաշխումը հավասարաչափ չէ։ Նրա ամենամեծ կուտակումը մարզի արևելյան հատվածում է։ Դեպի արևմուտք շարժվելիս այն կտրուկ նվազում է։",
            img: [
                {
                    src: 'https://app.conciergetravel.am/storage/2HhguBGKTV9haRsNCgo9XauCuiqrbp78rheU5vfH.png',
                    text: 'ԶՎԱՐԹՆՈՑ'
                },
                {
                    src: 'https://app.conciergetravel.am/storage/mnGAeqbkOIBIHcnNVKwN0eNfyWyBj9q1Tlpk5Wy7.jpg ',
                    text: "ՍԱՐԴԱՐԱՊԱՏ"
                },
                {
                    src: 'https://app.conciergetravel.am/storage/XveTmKgGM2PBHW1S9weGFqeBBC10t8SdLZL0fnE9.jpg',
                    text: "ԷՋՄԻԱԾՆԻ ՄԱՅՐ ՏԱՃԱՐ"
                }
            ]
        },
        {
            name: "գեղարքունիք",
            background: "https://rozaug.ru/assets/galleries/822/1648775719_22-vsegda-pomnim-com-p-ozero-sevan-armeniya-foto-23.jpg",
            description: "Տարածքի մեծությամբ այն առաջինն է Հայաստանում։ Մարզն այնքան մեծ է, որ նրանում հանգիստ կտեղավորվեն Արարատի, Արմավիրի և Կոտայքի մարզերն ամբողջությամբ։ Ամբողջ տարածքի շուրջ 1/4-ը զբաղեցնում է Սևանա լիճը։ Հյուսիսից սահմանակից է Տավուշի մարզին, արևելքից՝ Ադրբեջանին և Արցախին, արևմուտքից՝ Կոտայքի և Արարատի մարզերին, իսկ հարավից՝ Վայոց ձորի մարզին։ Տրանսպորտաաշխարհագրական դիրքը, ի տարբերություն Հայաստանի այլ մարզերի, անբարենպաստ է։ Գլխավոր ճանապարհներն են՝ Ճամբարակ-Բերդ, Մարտունի-Եղեգնաձոր և Երևան-Սևան-Սոթք երկաթուղին Տարածքում շատ են հրաբխային կոները, որոնցից հայտնի են հատկապես Արմաղանն ու Աժդահակը, որոնց խառնարաններում գտնվում են համանուն լճերը։ Գլխավոր լեռնաշղթաներն են Գեղամա, Արեգունի, Սևանի, Արևելյան Սևանի, Վարդենիսի։ Սևանի ավազանն արգավանդ հողերով հարուստ է, հատկապես կարևոր է Մասրիկի դաշտը՝ 1900-2200 մ բարձրություններում։ Կլիման բարեխառն լեռնային է. ձմեռները ցուրտ են, առաջանում է կայուն ձնածածկույթ։ Հունվարյան միջին ջերմաստիճանը -5˚-10˚ է։ Ամառները տաք են, արևոտ։ Միջին ջերմաստիճանն հասնում է +18˚+20˚։ Տեղումները քիչ են՝ 400-450 մմ, իսկ բարձրադիր շրջաններում մինչև 1000 մմ։ Օգտակար հանածոներից մեծ արժեք են ներկայացնում ոսկու (Սոթք), քրոմիտի (Շորժա), բնական շինանյութերի, հանքային ջրերի (Լիճք) և այլ պաշարները։Սևանա լիճը ամբողջությամբ գտնվում է Գեղարքունիքի մարզում։ Գեղարքունիքի մարզում է գտնվում Սոթքի ոսկու խոշոր հանքավայրերը։Արարատի մարզի հարավարևմտյան եզրին զուգահեռ 6-13 կմ լայնությամբ ընկած է Արարատյան հարթավայրի հարավարևելյան մասը։ Հյուսիսում Երանոսի լեռնաշղթան է։ Հյուսիսային սահմանն անցնում է Ազատ և դրա վտակ Գողթ գետերով։ Հյուսիս-արևելքում Գեղամա լեռնաշղթայի հարավարևմտյան հատվածն է։ Արևելքում Մժկատարի լեռներն են, որից արևմուտք ընկած է Դահնակի լեռնաշղթան, սրանից էլ հարավ գտնվում է Ուրծի լեռնաշղթան։ Մարզի կենտրոնում Երասխի լեռներն են, Կոտուց, Խոսրովասար լեռնագագաթները և այլ լեռնազանգվածներ։",
            img: [
                {
                    src: 'https://app.conciergetravel.am/storage/qPbzIbkRZjAeI7OfzDRdY5S24VEgZTAFvufRh9W8.jpg',
                    text: "ՍԵՎԱՆԱՎԱՆՔ"
                },
                {
                    src: 'https://app.conciergetravel.am/storage/avmKWG2UghD7CY8u7U0tip6GY8VGKhN49u6PTz6u.jpg',
                    text: "ՍԵՎԱՆ"
                },
                {
                    src: 'https://app.conciergetravel.am/storage/if672roqmZwRREeqoKclutBzaVxpd1h8tecmFm76.jpg',
                    text: "ԱԺԴԱՀԱԿ ԼԵՌ"
                }
            ]
        },
        {
            name: "կոտայք",
            background: "https://img.freepik.com/premium-photo/geghard-medieval-monastery-kotayk-province-armenia_261932-3919.jpg?w=2000",
            description: "<b>Կոտայքի մարզ, մարզի կարգավիճակ ունեցող վարչատարածքային միավոր Հայաստանում</b>։ Միակ մարզն է, որը միջպետական սահման չունի Հայաստանի հարևան որևէ պետության հետ։ Կոտայքը միաժամանակ նաև այն չորս մարզերից մեկն է, որոնք անմիջապես հարում են մայրաքաղաք Երևանին։Մարզի տարածքն ընդգրկում է Կոտայքի սարավանդը, Մարմարիկ գետի ավազանը, Հրազդան գետի ավազանի վերին ու միջին հատվածը, ինչպես նաև Գեղամա լեռնաշղթայի արևմտյան լանջերը։ <b>Այն հարավ-արևմուտքից սահմանակի է մայրաքաղաքին, արևմուտքից՝ Արագածոտնի, հյուսիսից՝ Լոռու, հյուսիս-արևելքից՝ Տավուշի, արևելքից՝ Գեղարքունիքի և հարավից՝ Արարատի մարզերին</b>։Կոտայքի մարզի վարչական կենտրոնը Հրազդանն է։ Ամենամեծ քաղաքն Հրազդանն է։ Կոտայքի մարզը զբաղեցնում է <b>2089 կմ² տարածք (8-րդը Հայաստանի մարզերի շարքում)։ Ըստ 2011 թվականի տվյալների՝ մարզի բնակչությունը կազմում է 254 397 մարդ</b>։Կոտայքի արևմտյան մասը նախկինում մտել է Մեծ Հայքի Այրարատ նահանգի Կոտայք, իսկ արևելյանը՝ Մազազ գավառների մեջ։ Ներկայիս վարչատարածքային միավորը ձևավորվել է Հայկական ԽՍՀ-ի մաս կազմող Աբովյանի, Հրազդանի և Նաիրիի շրջանների միավորման հետևանքով։ Կոտայքի մարզը խորհրդային տարիներին ունեցել է զարգացած մեքենաշինական, հաստոցաշինական արդյունաբերություն, որն այժմ գրեթե վերացել է։Կոտայքի մարզը Հանրապետության տնտեսական խոշորագույն կենտրոններից է։ Հրազդանում մինչ օրս գործում է ջերմաէլեկտրակայան և ջրաէլեկտրակայան, որոնք բավարարում են Հայաստանի էներգետիկ պահանջների մի մասը։  Մարմարիկ գետի ձախ ափին գտնվող Մեղրաձոր գյուղում պահվում են երկրի ոսկու պաշարների մեծ մասը։ Ծաղկաձոր քաղաքը Հայաստանի լեռնադահուկային սպորտի կենտրոնն է, որն ունի կարևոր զբոսաշրջային նշանակություն։ Մարզի տարածքը հարուստ է նաև պատմամշակութային հուշարձաններով։ Դրանց մարգարիտը <b>Գառնու հեթանոսական տաճարն է, որը կառուցվել է 1-ին դարում և համարվում է մինչ օրս պահպանված նախաքրիստոնեական հայկական արվեստի եզակի նմուշներից մեկը</b>։ Նշանավոր են նաև Գրիգոր Մագիստրոս Պահլավունու կողմից կառուցված Բջնի բերդը, ինչպես նաև միջնադարյան Կեչառիսի վանքային համալիրը և Գեղարդավանքը՝ ուր և պահվում էր հայտնի գեղարդը, որով հռոմեացի զինվորը խոցել է Քրիստոսի կողը։",
            img: [
                {
                    src: 'https://app.conciergetravel.am/storage/bkQ0jECra7dAnRf11OJVguAJQz30XNeAE3mztPRn.jpg',
                    text: "ՔԱՐԵՐԻ ՍԻՄՖՈՆԻԱ"
                },
                {
                    src: 'https://app.conciergetravel.am/storage/PlU9hyqWjdRhV3WJ1pGQtPxsUER2DGfnTGg1Dhem.jpg',
                    text: "ՉԱՐԵՆՑԻ ԿԱՄԱՐ"
                },
                {
                    src: 'https://app.conciergetravel.am/storage/hZIKPWWycMJfFs9RamUN4BxUGpLgBtfU5tlfUPrR.jpg',
                    text: "ԳԵՂԱՄԱ ԼԵՌՆԵՐ"
                },


            ]
        },
        {
            name: "լոռի",
            background: "https://scontent.fevn1-1.fna.fbcdn.net/v/t1.6435-9/97712661_121326489570066_2586402204407562240_n.jpg?stp=dst-jpg_s720x720&_nc_cat=107&ccb=1-7&_nc_sid=730e14&_nc_ohc=adEb-Un2hooAX-g8Frz&_nc_ht=scontent.fevn1-1.fna&oh=00_AfB8nBW0mR2j-vBBCNNLAyLuwBOy4NnXTTSkCyyoC0ySLw&oe=6503E388",
            description: "<b>Լոռու մարզ, մարզի կարգավիճակ ունեցող վարչատարածքային միավոր Հայաստանի հյուսիսում</b> Զբաղեցնում է պատմական Հայաստանի Գուգարաց նահանգի արևելյան հատվածն ու Այրարատ նահանգի Նիգ գավառի հյուսիսային տիրույթները։Լոռու մարզն ունի ցայտուն արտահայտված բնական սահմաններ։ Այն ընդգրկում է Դեբեդ գետի ավազանն ամբողջությամբ և հիմնականում ունի լեռնային ռելիեֆ՝ բարձրադիր լեռներ, անդնդախոր, երբեմն սուր կտրվածքով կիրճեր։ Նրա տարածքում են ձգվում Ջավախքի, Բազումի, Փամբակի, Գուգարաց, Վիրահայոց և Հալաբի լեռնաշղթաները։ Առանձնանում են Լոռու,Փամբակի գոգավորությունները և Լոռվա ձորը։ Բնակավայրերը գտնվում են <b>ծովի մակերևույթից 520-ից մինչև 1800 մետր բարձրության վրա</b>։  Մարզի վարչական կենտրոն հանդիսացող <b>Վանաձոր քաղաքը համարվում է Հայաստանի երրորդ խոշորագույն քաղաքը՝ շուրջ 80 հազար բնակչությամբ։ Մյուս խոշոր բնակավայրերն են Ալավերդին, Ստեփանավանը, Սպիտակը, Թումանյանը, Ախթալան և Տաշիրը։ Ըստ 2020 թվականի տարեսկզբի տվյալների՝ մարզի բնակչությունը կազմում է 213․3 հազար մարդ, որի ճնշող մեծամասնությունը հայերն են</b>, սակայն համեմատականորեն քիչ չեն նաև ազգային փոքրամասնությունների (ռուսական, հունական, եզդիական, ուկրաինական և այլն) համայնքները։Լոռին Հայաստանի արդյունաբերական մարզերից է։ Այստեղ են գործում Հայաստանի տնտեսության արդյունաբերական ճյուղի անկյունաքարային նշանակություն ունեցող մի շարք օբյեկտներ։ Արդյունաբերության զարգացվածության ֆոնին ավելի քիչ զարգացած է գյուղատնտեսությունըԼոռին աչքի է ընկնում նաև հարուստ մշակութային ժառանգությամբ և պատմական անցյալով, որի մասին վկայում են տասնյակ վանքերը, բերդերը, ամրոցներն ու հուշակոթողները։ Պատմամշակութային ինքնատիպ հուշարձանների բազմազանությունը որոշակիորեն պայմանավորված է այն հանգամանքով, որ <b>10-12-րդ դարերում</b> այստեղ գոյություն է ունեցել անկախ հայկական պետականություն՝ ի դեմս Լոռու կամ Տաշիր-Ձորագետի թագավորության։ Հայաստանում <b>ՅՈՒՆԵՍԿՕ-ի Համաշխարհային ժառանգության ցանկում ներառված օբյեկտներից երկուսը՝ Հաղպատի ու Սանահինի միջնադարյան վանական համալիրները գտնվում են Լոռու մարզում</b>։",
            img: [
                {
                    src: 'https://app.conciergetravel.am/storage/nfPvZblADzTzozWlEUEykmTBTchZK0FW615za1wr.jpg',
                    text: "ԱԽԹԱԼԱ"
                },
                {
                    src: 'https://app.conciergetravel.am/storage/AoRDtoRaXLst7N9yYPE70LPOitQa2n48yRzZZDbj.jpg',
                    text: "ՀԱՂՊԱՏԱՎԱՆՔ"
                },
                {
                    src: 'https://app.conciergetravel.am/storage/EyXieSwdnkNel7nr44wFY9tcOxqVy2S3782GbVMt.jpg',
                    text: "ԼՈՌԻ ԲԵՐԴ"
                },

            ]
        },
        {
            name: "շիրակ",
            background: "https://upload.wikimedia.org/wikipedia/commons/2/2d/%D4%B9%D5%A9%D5%B9%D5%AF%D5%A1%D5%B6_trchkan.jpg",
            description: "<b>Մարզի տարածքում են գտնվում Արփի լիճ-ջրամբարը, Ախուրյանի ջրամբարի հայկական հատվածը և Մանթաշի ջրամբարը</b>։ Շիրակի մարզի կենտրոնական և <b>հարավային հատվածում տարածվում է Շիրակի դաշտը, իսկ հյուսիսային շրջանում՝ Աշոցքի սարահարթը, միաժամանակ Շիրակի մարզում են տարածվում Փամբակի, Բազումի լեռնաշղթաների, Եղնախաղի, Ջավախքի, Արագածի լեռնազանգվածների մի մասը</b>։ Երկրաբանական կառուցվածքի տեսակետից տարածքը ընդհանուր առմամբ ունի համեմատաբար միատարր հրաբխային կազմություն և երիտասարդ հասակ։ Հայկական լեռնաշխարհի հետ միասին մարզի տարածքն անցել է երկրաբանական զարգացման բարդ ուղի։ Եռանդուն տեկտոնական շարժումները, որոնց շնորհիվ երկրակեղևը ծալքավորվել ու կոտրվել է, տեղի է ունեցել երկրաբանական տարբեր ժամանակաշրջաններում։ Սակայն մարզի ռելիեֆի ձևավորման գործում գլխավոր դերը պատկանում է ալպյան լեռնակազմությանը, երբ տարածքը բարձրացել է ծովի հատակից և թևակոխել ցամաքային զարգացման փուլ։ Հետագայում, շարունակվելով վերընթաց տեկտոնական շարժումները, ձևավորվել են միջին բարձրության լեռներ։ Նեոգենի ժամանակաշրջանի կեսերին տեղի ունեցած հզոր լեռնակազմական պրոցեսների հետևանքով տարածքի շրջակա լեռները դարձել են ավելի բարձր, հովիտները` ավելի խորը։ Այդ ժամանակաշրջանում է, որ այստեղ գոյանում են երկրակեղևի տարբեր ուղղություններով ձգվող Սևան-Շիրակի, Ջավախք-Արագած-Մասիսի և Աշոցքի բեկվածքները։<b>Եռանդուն տեկտոնական շարժումները ուղեկցվել են բուռն հրաբխականությամբ, որն ընդգրկել է մարզի ամբողջ տարածքը` սկսած Եղնախաղից, Աշոցքից մինչև Արագած</b>։ Հրաբխային արտավիժման և ժայթքման նյութերը ծածկել են հսկայական տարածություններ` իրենց տակ թողնելով ծալքավոր և ծալքաբեկորավոր լեռների խղզման գծերի զգալի մասը` <b>դրանց վրա գոյացնելով հրաբխային լեռնավահաններ, առանձին լեռնազանգվածներ, սարավանդներ։ Նման եղանակով են գոյացել Արագած լեռնազանգվածը, Ջավախքի, Աշոցքի, Եղնախաղի լեռնավահանները, Աշոցքի և Շիրակի սարահարթերը</b>։",
            img:
                [
                    {
                        src: 'https://app.conciergetravel.am/storage/7r31P6BO3k1Quiypmg2BfEXQLWs91dkCjAcdTYLU.jpg',
                        text: "ԹՌՉԿԱՆԻ ՋՐՎԵԺ"

                    },
                    {
                        src: 'https://armenia-tour.am/wp-content/uploads/2016/01/1Armenie.jpg',
                        text: "Շիրակի մարզի հնավայր"
                    },
                    {
                        src: 'https://app.conciergetravel.am/storage/5df4bA6F819XdX16TmcsqMReagKPF4aZJy2KZnJA.jpg',
                        text: "ՀԱՌԻՃԱՎԱՆՔ"
                    },

                ]
        },
        {
            name: "սյունիք",
            background: "https://www.xtrafondos.com/en/descargar.php?id=6579&resolucion=5120x2880",
            description: "<b>Սյունիքի մարզ, ամենաբարձր կարգավիճակ ունեցող վարչատարածքային միավոր Հայաստանի հարավում։ Հյուսիսում սահմանակից է Հայաստանի Վայոց ձորի մարզին, հյուսիս-արևելքում՝ Արցախի Հանրապետության Շահումյանի շրջանի քարվաճառյան հատվածին և Քաշաթաղի շրջանին, հարավում՝ Իրանի Իսլամական Հանրապետությանը Արևելյան Ադրբեջան նահանգին, արևմուտքից՝ Ադրբեջանի Հանրապետության կազմում ընդգրկված Նախիջևանի Ինքնավար Հանրապետության Ջավախքի, Օրդուբադի և Շահբուզի շրջաններին</b>։Սյունիքն ունի հազարամյակների պատմություն․ այն սկսվում է անհիշելի ժամանակներից, շարունակվում Վանի թագավորության, Մեծ Հայքի թագավորության, Սյունիքի իշխանության շրջաններով։ Մարզը հարուստ է պատմամշակութային ժառանգություն։ Այստեղ պահպանվել են նախնադարյան բնակատեղիներ, ամրություններ, դամբարանադաշտեր, մեր թվարկությամբ թվագրվող ամրոցներ, կրոնական կառույցներ և ձեռակերտ այլ արժեքավոր օբյեկտներ։Մարզի վարչական կենտրոն հանդիսացող Կապան քաղաքը համարվում է <b>բնակչության թվաքանակով Հայաստանի վեցերորդ խոշորագույն քաղաքը՝ շուրջ 42․600 բնակչությամբ։ Մյուս խոշոր բնակավայրերն են Գորիսը, Սիսիանը, Քաջարանը, Մեղրին, Ագարակը։ 2020 թվականի հունվարի 1-ի դրությամբ՝ մարզի բնակչությունը կազմում է 135․800 մարդ</b>։      Սյունիքի տարածքն ունի հարուստ կենսաբազմազանություն։ Այն հիմնականում կազմված է լեռնային գոտիներից։ Սյունիքի մարզի տարածքը կազմում է 4506կմ2, ինչը Հայաստանի ընդհանուր տարածքի <b>15.1%-ն է</b>։ Վարչատարածքային բաժանման տեսակետից Սյունիքի մարզը բաժանված է 8 համայնքի, որոնցից յուրաքանչյուրն ընդգրկում է բազմաթիվ բնակավայրեր։ Մարզի համայնքներն են՝ Գորայքը<b> (կենտրոնը՝ Գորայք գյուղ), Մեղրին (կենտրոնը՝ Մեղրի քաղաք), Տեղը (կենտրոնը՝ Տեղ գյուղ), Գորիսը (կենտրոնը՝ Գորիս քաղաք), Սիսիանը (կենտրոնը՝ Սիսիան քաղաք), Քաջարանը (կենտրոնը՝ Քաջարան քաղաք), Կապանը (կենտրոնը՝ Կապան քաղաք), Տաթևը (կենտրոնը՝ Շինուհայր գյուղ)։Սյունիքի մարզը ունի 138 բնակավայր․ 7 քաղաք՝ Ագարակ, Գորիս, Դաստակերտ, Կապան, Մեղրի, Սիսիան և Քաջարան, ու 131 գյուղ</b>։",
            img: [
                {
                    src: 'https://armenia-tour.am/wp-content/uploads/2015/12/1024px-Tatev_Monastery_Armenia-1.jpg',
                    text: "Տաթևի վանք"
                },
                {
                    src: 'https://app.conciergetravel.am/storage/cWiY1gsii7DR7PlJLLfthCwYuslSuzgYlpNQHSgV.jpg',
                    text: "ԽՈՒՍՏՈՒՓ ԼԵՌ"
                },
                {
                    src: 'https://app.conciergetravel.am/storage/oxbeTqLwURlfmHrxotyJMqXB02IiTd3blZeAVSB6.jpg',
                    text: "ՇԱՔԻԻ ՋՐՎԵԺ"
                },
                {
                    src: 'https://app.conciergetravel.am/storage/4HvDr0xgW8pbtlebQHXNvuI9kHB2NfzcPxgVPtsO.jpg',
                    text: "ՍԱՏԱՆԻ ԿԱՄՈՒՐՋ"
                },
                

            ]
        },
        {
            name: "տավուշ",
            background: "https://img.itinari.com/pages/images/original/90a9f68c-e709-4890-947e-3a1b6da6bf66-istock-592362992.jpg?ch=DPR&dpr=2.625&w=1600&s=b177f64fa70a827378a7fe03f2636969",
            description: "<b>Տավուշ մարզի </b>  ուղղաձիգ գոտիականությունը կանխորոշում է մարզի կլիման։ Այն գտնվում է հանրապետության չափավոր խոնավ տարածաշրջանում։ Արևափայլքի տարեկան տևողությունը <b>1900-2000 ժամ  է։ հանրապետությունում առավելագույն անարև օրերի դիտվում է Իջևանում՝ մինչև 65օր։</b> Գարունը լինում է տևական և հաճախ ուղեկցվում ցրտահարություններով, ամառը չափավոր տաք է, ձմեռը՝ մեղմ։ Լեռների բարձրության և դիրքադրման հետ կապված՝ մարզի լեռնային հարավն ու հովտային հյուսիսը զգալիորեն տարբերվում են կլիմայական պայմաններով։ Հարավի բարձրադիր լեռներում նվազագույն ջերմաստիճանը կարող է հասնել <b>-38°C-ի, իսկ առավելագույն ջերմաստիճանը հյուսիսի ցածրադիր հովիտներում՝ 38-40 °C-ի</b>։ վերջին տասնամյակներում անսովոր շոգեր գրանցվել են <b>1996 և 2000 </b> թվականին, երբ Նոյեմբերյանում, Բերդում և Իջևանում ջերմաչափը ցույց է տվել համապատասխանաբար <b>42-43°C</b> աստիճան, ընդ որում անսովոր շոգը ուղեկցվել է երաշտով, որի հետևանքով հսկայական վնասներ կրեցին գյուղացիական տնտեսությունները։ Լինում են նաև հակառակ երևույթը, երբ չափազանց շատ տեղումներ են տեղի ունենում, օրինակ <b>2002 թվականի ամռանը։ Տարեկան տեղումների քանակը 550-600 մմ է </b>, առավելագույնը՝ ապրիլ-մայիս ամիսներին, որի պատճառով ծառերը հաճախ ծաղկավիժում են։ Ձյունածածկույթի հզորությունը միջին գոտիներում սովորաբար լինում է <b>10-15սմ, իսկ անսառնամանիք օրերի քանակը՝ 100-240</b>։ Ձմռանը մարզի հարավային սարերում, ձյան առատության և բքի պատճառով դժվարանում է մայրուղիների երթևեկությունը։ Մարզում, ընդհանրապես, և Աղստևի հովտում հաճախակի երևույթ է կարկտահարությունը։",
            img: [
                {
                    src: 'https://www.advantour.com/img/armenia/tavush/haghartsin-monastery.jpg',
                    text: "Հաղարծին"
                },
                {
                    src: 'https://www.advantour.com/img/armenia/tavush/haghartsin6.jpg',
                    text: "Հաղարծին"
                },
                {
                    src: 'https://impoqrik.am/images/2013hunvar/goshavanq1.jpg',
                    text: "Գոշավանք"
                }
            ]
        },
        {
            name: "վայոց ձոր",
            background: "https://free4kwallpapers.com/uploads/originals/2019/07/07/armenia-vayots-dzor-zangak--wallpaper.jpg",
            description: "<b>Վայոց ձորի մարզ, մարզի կարգավիճակ ունեցող վարչատարածքային միավոր Հայաստանի հարավարևելյան վերջույթում</b>։ Զբաղեցնում է պատմական Հայաստանի Սյունյաց նահանգի նույնանուն գավառի հիմնական տարածքը։ Ներկայիս վարչատարածքային միավորը ձևավորվել է Հայկական ԽՍՀ-ի մաս կազմած Եղեգնաձորի և Վայքի (Ազիզբեկովի) շրջանների միավորման հետևանքով՝ 1995 թվականի բարեփոխումների արդյունքում։Վայոց ձորի մարզը զբաղեցնում է <b>2,308 կմ² տարածք (7-րդը Հայաստանի մարզերի շարքում)։ Ընդգրկում է երեք հիմնական աշխարհագրական շրջաններ՝ Արփայի գոգավորություն, Վայքի ծալքաբեկորավոր լեռնաշղթա (ձգվում է հարավում) և Վարդենիսի հրաբխային լեռնավահան։ Հյուսիսում սահմանակցում է Գեղարքունիքի մարզին, հյուսիս-արևելքում՝ Արցախի Հանրապետությանը, հարավ-արևմուտքում՝ Սյունիքի մարզին, հարավային հատվածում՝ Նախիջևանին, իսկ արևմուտքում՝ Արարատի մարզին</b>։ Մայրաքաղաք Երևանին անմիջապես չի հարում։Վայոց ձորի մարզի վարչական կենտրոնը Եղեգնաձոր համայնքն է <b>(բնակչությունը՝ 7800 մարդ)</b>, որը հանդիսանում է նաև մարզի խոշորագույն քաղաքը։ <b>Վարչատարածքային միավորի մյուս քաղաքային բնակավայրերն են Վայքն ու Ջերմուկը։ Վերջինս համարվում է զբոսաշրջային կարևոր նշանակություն ունեցող առողջարանային քաղաք</b>։ Ըստ 2019 թվականի մարդահամարի տվյալների՝ <b>մարզի բնակչությունը կազմում է 49 հազար մարդ, որը ճնշող մեծամասնությունը հայերն են (99 % և ավելի)</b>։ Վայոց ձորը համարվում է Հայաստանի ամենաքիչ և ամենանոսր բնակեցված մարզը։Վայոց ձորը Հայաստանի տնտեսապես ամենաթույլ զարգացած մարզերից մեկն է։ Տնտեսության առաջատար ճյուղը գյուղատնտեսությունը, որի ավանդական ուղղություններից մեկն էլ խաղողագործությունն է։ Ինքնին, <b>Վայոց ձորը հանդիսանում է Հայաստանի խաղողագործական չորս շրջաններից մեկը, որը աչքի է ընկնում գինեգործության հազարամյա ավանդույթներով։ «Արենի» տեսակի խաղողից այստեղ պատրաստվում է նույնանուն հանրահայտ գինին։</b>",
            img: [
                {
                    src: 'https://www.advantour.com/img/armenia/vayots-dzor/vayots-dzor.jpg',
                    text: "Ջերմուկ"
                },
                {
                    src: 'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSqvMEZiiNbrRZJxf5qJpR7JHy9fHrt64F3Fx8yCdvnnRim-sUQCkN7RxOHuecT6GHYbO8&usqp=CAU',
                    text: "Արենի"
                },
                {
                    src: 'https://app.conciergetravel.am/storage/5lWdSlkPhneUQLAlC8d7Pmsg7qEnzhOoLN5V7nXv.png',
                    text: "ՍՄԲԱՏԱԲԵՐԴ"
                }
            ]
        }
    ]

    useEffect(() => {
        const reg = regions.find(reg => reg.name === region)
        setInfo(reg)


        let i = Math.floor(reg.description.length / 2)
        while (true) {
            if (reg.description[i] === "։" || reg.description[i] === ":") {
                setText({
                    part1: reg.description.slice(0, i + 1),
                    part2: reg.description.slice(i + 1)
                })
                break
            }
            i++
        }

    }, [region])

    return (
        <>
            <div className={styles.list}>
                {
                    pages.map((link) => {
                        return <Link to={`/${link.name}`} key={link.name} className={styles.link}>{link.name}</Link>
                    })
                }
            </div>
            <header style={{ background: `url(${info?.background})` }} className={styles.heading}>
                <h1 className={styles.title}>{info.name}</h1>
            </header>
            <div className={styles.text}>
                <p className={styles.part1} dangerouslySetInnerHTML={{ __html: text.part1 }}></p>

                <div className={styles.imgs}>
                    {info.img.map(
                        (x, i) => (
                            <div className={styles.img} key={i}>
                                <img key={i} alt="" src={x.src} />
                                <div className={styles.imgText}>
                                    {
                                        x?.text
                                    }
                                </div>
                            </div>
                        )
                    )}
                </div>

                <p className="part2" dangerouslySetInnerHTML={{ __html: text?.part2 }}></p>
            </div>
        </>
    )
}

export default Page
